Tekla.Structures.ComponentOptions.BoltEdgeDistanceReferenceEnum
The bolt edge distance reference type.

Tekla.Structures.ComponentOptions.BoltEdgeDistanceReferenceEnum.BOLT_DIAMETER
Compares the edge distance to the bolt diameter.

Tekla.Structures.ComponentOptions.BoltEdgeDistanceReferenceEnum.HOLE_DIAMETER
Compares the edge distance to the hole diameter.